Revit 2024 API
RebarContainerParameterManager.RemoveOverride Method
 Removes an overridden value from the given parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void RemoveOverride(
	ElementId paramId
)
Visual Basic
Public Sub RemoveOverride ( _
	paramId As ElementId _
)
Visual C++
public:
void RemoveOverride(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 The id of the parameter
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId has no override
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace